app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "baba"], ["text", "aba"], ["created_at", "2019-04-12 09:29:38.430125"], ["updated_at", "2019-04-12 09:29:38.430125"]]
---
  def create
    @article = Article.new(article_params)

    @article.save