app/controllers/cars_controller.rb

  def create
    @car = current_user.cars.build(car_params)

    @car.save
---
INSERT INTO "cars" ("title", "descreption", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "car with user id"], ["descreption", "lkdsflksjf"], ["created_at", "2019-04-13 11:08:27.390521"], ["updated_at", "2019-04-13 11:08:27.390521"], ["user_id", 1]]

  def show
    @car = Car.find(params[:id])
---
SELECT  "cars".* FROM "cars" WHERE "cars"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]